Extensions/УВМ/Documents/КадровыйПереводСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадровыйПереводСписком</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УВМ_Руководитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Documents/КадровыйПереводСписком/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура УВМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++dar 27.09.23 (147515)
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_Подразделение", Элементы.Шапка, Истина);
	//--dar 27.09.23 (147515)
	
	//++dar 25.06.25 (255715)
	Если Объект.Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		СвойстваПоля_Руководитель = Новый Структура;
		СвойстваПоля_Руководитель.Вставить("АвтоОтметкаНезаполненного", Истина);
		УВМ_РаботаСФормами.НоваяКолонкаТаблицыФормы(ЭтотОбъект, "УВМ_Руководитель", "Сотрудники", "Объект.Сотрудники.УВМ_Руководитель", , 
																"Руководитель", , , СвойстваПоля_Руководитель);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	
КонецПроцедуры
